energia/cc3200-core/boards.txt
CC3200-LAUNCHXL.name=CC3200-LAUNCHXL (80MHz)
CC3200-LAUNCHXL.upload.maximum_size=196608
CC3200-LAUNCHXL.build.mcu=cortex-m4
CC3200-LAUNCHXL.build.f_cpu=80000000L
CC3200-LAUNCHXL.build.core=cc3200
CC3200-LAUNCHXL.build.variant=CC3200-LAUNCHXL
CC3200-LAUNCHXL.build.ldscript=cc3200.ld
CC3200-LAUNCHXL.build.board=CC3200_LAUNCHXL
CC3200-LAUNCHXL.build.mcu=cortex-m4
CC3200-LAUNCHXL.upload.tool=cc3200prog
CC3200-LAUNCHXL.upload.protocol=cc3200prog
CC3200-LAUNCHXL.upload.maximum_data_size=196608
##############################################################

CC3200-RBL.name=RedBearLab CC3200 (80MHz)
CC3200-RBL.upload.maximum_size=196608
CC3200-RBL.build.mcu=cortex-m4
CC3200-RBL.build.f_cpu=80000000L
CC3200-RBL.build.core=cc3200
CC3200-RBL.build.variant=RedBearLab_CC3200
CC3200-RBL.build.ldscript=cc3200.ld
CC3200-RBL.build.board=RedBearLab_CC3200
CC3200-RBL.build.mcu=cortex-m4
CC3200-RBL.upload.tool=cc3200prog
CC3200-RBL.upload.protocol=cc3200prog
CC3200-RBL.upload.maximum_data_size=196608
##############################################################

CC3200-RBL-MINI.name=RedBearLab WiFi Mini w/ CC3200 (80MHz)
CC3200-RBL-MINI.upload.maximum_size=196608
CC3200-RBL-MINI.build.mcu=cortex-m4
CC3200-RBL-MINI.build.f_cpu=80000000L
CC3200-RBL-MINI.build.core=cc3200
CC3200-RBL-MINI.build.variant=RedBearLab_WiFiMini
CC3200-RBL-MINI.build.ldscript=cc3200.ld
CC3200-RBL-MINI.build.board=RedBearLab_WiFiMini
CC3200-RBL-MINI.build.mcu=cortex-m4
CC3200-RBL-MINI.upload.tool=cc3200prog
CC3200-RBL-MINI.upload.protocol=cc3200prog
CC3200-RBL-MINI.upload.maximum_data_size=196608
##############################################################

CC3200-RBL-MICRO.name=RedBearLab WiFi Micro w/ CC3200 (80MHz)
CC3200-RBL-MICRO.upload.maximum_size=196608
CC3200-RBL-MICRO.build.mcu=cortex-m4
CC3200-RBL-MICRO.build.f_cpu=80000000L
CC3200-RBL-MICRO.build.core=cc3200
CC3200-RBL-MICRO.build.variant=RedBearLab_WiFiMicro
CC3200-RBL-MICRO.build.ldscript=cc3200.ld
CC3200-RBL-MICRO.build.board=RedBearLab_WiFiMicro
CC3200-RBL-MICRO.build.mcu=cortex-m4
CC3200-RBL-MICRO.upload.tool=cc3200prog
CC3200-RBL-MICRO.upload.protocol=cc3200prog
CC3200-RBL-MICRO.upload.maximum_data_size=196608
##############################################################
